rsvp/tests/Thread Group2.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.2" jmeter="3.2 r1790748">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Memcache" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <kg.apc.jmeter.threads.SteppingThreadGroup guiclass="kg.apc.jmeter.threads.SteppingThreadGroupGui" testclass="kg.apc.jmeter.threads.SteppingThreadGroup" testname="jp@gc - Stepping Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="ThreadGroup.num_threads">1500</stringProp>
        <stringProp name="Threads initial delay">0</stringProp>
        <stringProp name="Start users count">200</stringProp>
        <stringProp name="Start users count burst">0</stringProp>
        <stringProp name="Start users period">600</stringProp>
        <stringProp name="Stop users count">5</stringProp>
        <stringProp name="Stop users period">1</stringProp>
        <stringProp name="rampUp">60</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
      </kg.apc.jmeter.threads.SteppingThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">app-dot-useful-music-180113.appspot.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/query?id=5040718305296384</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <UserParameters guiclass="UserParametersGui" testclass="UserParameters" testname="User Parameters" enabled="true">
            <collectionProp name="UserParameters.names">
              <stringProp name="3373707">name</stringProp>
              <stringProp name="-1458646495">lastname</stringProp>
              <stringProp name="96619420">email</stringProp>
              <stringProp name="950484093">company</stringProp>
              <stringProp name="3377907">next</stringProp>
            </collectionProp>
            <collectionProp name="UserParameters.thread_values">
              <collectionProp name="1562729185">
                <stringProp name="-970882252">${__CSVRead(/home/pablo/Desktop/t3/rsvp/tests/users.csv,0)}</stringProp>
                <stringProp name="-970881291">${__CSVRead(/home/pablo/Desktop/t3/rsvp/tests/users.csv,1)}</stringProp>
                <stringProp name="-970880330">${__CSVRead(/home/pablo/Desktop/t3/rsvp/tests/users.csv,2)}</stringProp>
                <stringProp name="-970879369">${__CSVRead(/home/pablo/Desktop/t3/rsvp/tests/users.csv,3)}</stringProp>
                <stringProp name="586984471">${__CSVRead(/home/pablo/Desktop/t3/rsvp/tests/users.csv,next)}</stringProp>
              </collectionProp>
            </collectionProp>
            <boolProp name="UserParameters.per_iteration">true</boolProp>
          </UserParameters>
          <hashTree/>
        </hashTree>
        <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="jp@gc - Throughput Shaping Timer" enabled="true">
          <collectionProp name="load_profile">
            <collectionProp name="-1879230211">
              <stringProp name="48625">100</stringProp>
              <stringProp name="48625">100</stringProp>
              <stringProp name="53430">600</stringProp>
            </collectionProp>
            <collectionProp name="1764240317">
              <stringProp name="50547">300</stringProp>
              <stringProp name="50547">300</stringProp>
              <stringProp name="53430">600</stringProp>
            </collectionProp>
            <collectionProp name="1781805533">
              <stringProp name="54391">700</stringProp>
              <stringProp name="54391">700</stringProp>
              <stringProp name="53430">600</stringProp>
            </collectionProp>
            <collectionProp name="-257940780">
              <stringProp name="1507423">1000</stringProp>
              <stringProp name="1000">1000</stringProp>
              <stringProp name="53430">600</stringProp>
            </collectionProp>
            <collectionProp name="1403771869">
              <stringProp name="1512228">1500</stringProp>
              <stringProp name="1512228">1500</stringProp>
              <stringProp name="53430">600</stringProp>
            </collectionProp>
            <collectionProp name="1673903197">
              <stringProp name="1537214">2000</stringProp>
              <stringProp name="1537214">2000</stringProp>
              <stringProp name="53430">600</stringProp>
            </collectionProp>
            <collectionProp name="-26792419">
              <stringProp name="1542019">2500</stringProp>
              <stringProp name="1542019">2500</stringProp>
              <stringProp name="53430">600</stringProp>
            </collectionProp>
            <collectionProp name="243338909">
              <stringProp name="1567005">3000</stringProp>
              <stringProp name="1567005">3000</stringProp>
              <stringProp name="53430">600</stringProp>
            </collectionProp>
          </collectionProp>
        </kg.apc.jmeter.timers.VariableThroughputTimer>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">/home/pablo/uio.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
    <WorkBench guiclass="WorkBenchGui" testclass="WorkBench" testname="WorkBench" enabled="true">
      <boolProp name="WorkBench.save">true</boolProp>
    </WorkBench>
    <hashTree/>
  </hashTree>
</jmeterTestPlan>